In [43]:
# Setup
from env import host, user, password
import pandas as pd

In [60]:
# 3.
def get_db_url(host, user, password, database):
    return f'mysql+pymysql://{user}:{password}@{host}/employees'

In [62]:
url = get_bd_url(host, user, password, 'employees')

In [40]:
# 5. 
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
# and errors

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [39]:
# 6.
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20

In [37]:
pd.read_sql('SELECT * FROM titles LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [35]:
# 7.

'SELECT * FROM employees LIMIT 10'